# Gemini - Get Relevant Tables

In [2]:
%pip install google cbsodata

Requirement already satisfied: google in c:\users\makuz\appdata\local\programs\python\python312\lib\site-packages (3.0.0)
Requirement already satisfied: cbsodata in c:\users\makuz\appdata\local\programs\python\python312\lib\site-packages (1.3.5)
Requirement already satisfied: beautifulsoup4 in c:\users\makuz\appdata\local\programs\python\python312\lib\site-packages (from google) (4.12.3)
Requirement already satisfied: requests in c:\users\makuz\appdata\local\programs\python\python312\lib\site-packages (from cbsodata) (2.32.3)
Requirement already satisfied: soupsieve>1.2 in c:\users\makuz\appdata\local\programs\python\python312\lib\site-packages (from beautifulsoup4->google) (2.6)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\makuz\appdata\local\programs\python\python312\lib\site-packages (from requests->cbsodata) (3.4.0)
Requirement already satisfied: idna<4,>=2.5 in c:\users\makuz\appdata\local\programs\python\python312\lib\site-packages (from requests->cbsodata) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\makuz\appdata\local\programs\python\python312\lib\site-packages (from requests->cbsodata) (2.2.3)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\makuz\appdata\local\programs\python\python312\lib\site-packages (from requests->cbsodata) (2024.8.30)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [16]:
from google.generativeai import GenerativeModel
import google.generativeai as genai
import json
from typing import List, Dict, TypedDict
from ast import literal_eval
import cbsodata as cbs

c:\Users\makuz\AppData\Local\Programs\Python\Python312\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [3]:
class TableInfo(TypedDict):
    id: str
    description: str

In [4]:
def create_table_selector_prompt(tables: List[TableInfo], query: str) -> str:
    return f"""
    Given a user's query about data and a list of available tables, identify which tables would be most relevant for answering the query.
    
    Available tables:
    {json.dumps(tables, indent=2)}
    
    User query: {query}
    
    Select the table IDs that would be most relevant for answering this query. Consider:
    1. Direct matches between query topics and table descriptions
    2. Implicit relationships that might be needed to fully answer the query
    3. Select ALL tables that might contribute to a complete answer
    
    Ask clarifying questions if not enough information is available to complete the request.
    
    Provide your response as a single list of strings of table IDs. Nothing else.
    """

In [5]:
def get_relevant_ids_with_gemini(
  model: GenerativeModel,
  tables: List[TableInfo],
  query: str
) -> List[str]:
  prompt = create_table_selector_prompt(tables, query)
  response = model.generate_content(prompt)
  return literal_eval(response.text)

# CBS - Get Data From Gemini Response

## Get Table Descriptions and IDs

In [6]:
def extract_table_info(table: Dict) -> TableInfo:
    return {
        "id": 
            table["Identifier"],
        "description": 
            table["Title"].replace('\n', ' ').replace('\r', ' ') + " " +
            table["Summary"].replace('\n', ' ').replace('\r', ' ') + " " +
            table["ShortDescription"].replace('\n', ' ').replace('\r', ' ')
    }

In [7]:
def get_english_table_info(json_filename: str) -> List[TableInfo]:
  with open(json_filename, 'r') as file:
    english_tables = json.load(file)
  
  return [
    extract_table_info(table) for table in english_tables
  ]

In [ ]:
table_info = get_english_table_info('english_tables.json')

print(len(table_info))
table_info[0]

1010

{'id': '80783eng',
 'description': "Agriculture; crops, livestock and land use by general farm type, region Agricultural census; crops, livestock, land use and corresponding number of holdings by general farm type and region  This table contains data on land use, arable farming, horticulture, grassland, grazing livestock and housed animals, at regional level, by general farm type.  The figures in this table are derived from the agricultural census. Data collection for the agricultural census is part of a combined data collection for a.o. agricultural policy use and enforcement of the manure law.  Regional breakdown is based on the main location of the holding. Due to this the region where activities (crops, animals) are allocated may differ from the location where these activities actually occur.  The agricultural census is also used as the basis for the European Farm Structure Survey (FSS). Data from the agricultural census do not fully coincide with the FSS. In the FSS years (2000, 2003, 2005, 2007 and 2010)  additional information was collected to meet the requirements of the FSS.  Reference date for livestock is 1 April and for crops 15 May.  In 2022, equidae are not part of the Agricultural Census. This affects the farm type and the total number of farms in the Agricultural Census. Farms with horses, ponies and donkeys that were previously classified as ‘specialist grazing livestock' could be classified, according to their dominant activity, as another farm type in 2022.  From 2020 onwards, the SO2017, based on the years 2015 to 2019, will apply (see also the explanation for SO: Standard Output).  From 2018 onwards the number of calves for fattening, pigs for fattening, chicken and turkey are adjusted in the case of temporary breaks in the production cycle (e.g. sanitary cleaning). The agricultural census is a structural survey, in which adjustment for temporary breaks in the production cycle is a.o. relevant for the calculation of the economic size of the holding, and its farm type. In the livestock surveys the number of animals on the reference day is relevant, therefore no adjustment for temporary breaks in the production cycle are made. This means that the number of animals in the tables of the agricultural census may differ from those in the livestock tables (see ‘links to relevant tables and relevant articles).  From 2017 onwards, animal numbers are increasingly derived from I&R registers (Identification and Registration of animals), instead of by means of the combined data collection. The I&R registers are the responsibility of RVO (Netherlands Enterprise Agency). Since 2017, cattle numbers are derived from I&R cattle, and from 2018 sheep, goats and poultry are also derived from the relevant I&R registers. The registration of cattle, sheep and goats takes place directly at RVO. Poultry data is collected via the designated database Poultry Information System Poultry (KIP) from Avined. Avined is a branch organization for the egg and poultry meat sectors. Avined passes the data on to the central database of RVO. Due to the transition to the use of I&R registers, a change in classification will occur for sheep and goats from 2018 onwards.  Since 2016, information of the Dutch Business Register is used  to define the agricultural census. Registration in the Business Register with an agricultural standard industrial classification code (SIC), related to NACE/ISIC, (in Dutch SBI: ‘Standaard BedrijfsIndeling’) is leading to determine whether there is an agricultural holding. This aligns the agricultural census  as closely as possible to the statistical regulations of Eurostat and the (Dutch) implementation of the definition of 'active farmer' as described in the common agricultural policy.  The  definition of the agricultural census based on information from the Dutch Business Register mainly affects the number of holdings, a clear deviation of the trend occurs. The impact on areas (except for other land and rough grazing) and the number of animals (except for sheep, horses and ponies) is limited. This is mainly due  to the holdings that are excluded as a result of the new delimitation of  agricultural holdings (such as equestrian centres, city farms and organisations in nature management).  In 2011 there were changes in geographic assignment of holdings with a foreign main seat. This may influence regional figures, mainly in border regions.  Until 2010 the economic size of agricultural holdings was expressed in Dutch size units (in Dutch NGE: 'Nederlandse Grootte Eenheid'). From 2010 onwards this has become Standard Output (SO). This means that the threshold for holdings in the agricultural census has changed from 3 NGE to 3000 euro SO. For comparable time series the figures for 2000 up to and including 2009 have been recalculated, based on SO coefficients and SO typology. The latest update took place in 2016.   Data available from: 2000  Status of the figures: The figures are final.  Changes as of March 29, 2024: the final figures for 2023 have been added.  When will new figures be published? According to regular planning provisional figures are published in November and the definite figures will follow in March of the following year. "}

## Test Gemini on english datasets

In [17]:
# initialize the model
genai.configure(api_key="AIzaSyDKQzxYWUpb0-WBQXSVq5kWbeZiEzjm3zk")
model = genai.GenerativeModel(model_name='gemini-1.5-flash')

In [ ]:
relevant_ids = get_relevant_ids_with_gemini(
  model= model,
  tables = get_english_table_info('english_tables.json'),
  query= "What are the CO2 emissions by sector?"
)

relevant_ids

['83300ENG', '85669ENG', '84917ENG', '84918ENG']

In [114]:
len(relevant_ids)

4

In [115]:
for id in relevant_ids[:10]:
  print(cbs.get_info(id)['Title'])

Emissions to air by the Dutch economy; national accounts
Emissions of greenhouse gases according to IPCC guide-lines
Renewable energy; consumption by energy source, technology and application
Avoided use of fossil energy and emission of CO2

# Evaluation with Spider Dataset

In [6]:
import os
import json

In [ ]:
def get_test_questions(
  spider_dev_path = "C:/Users/makuz/Downloads/spider_data/spider_data/dev.json"
):

  with open(spider_dev_path, "r", encoding="utf-8") as f:
    dev_data = json.load(f)

  questions = [item["question"] for item in dev_data]
  return questions

get_test_questions()

In [ ]:
def create_all_schemas_txt(
  test_database_folder_path = "C:/Users/makuz/Downloads/spider_data/spider_data/test_database"
):

  db_files = [item for item in os.listdir(test_database_folder_path) if os.path.isdir(os.path.join(test_database_folder_path, item))]

  output_path = "all_schemas.txt"

  with open(output_path, "w", encoding="utf-8") as out_file:
    for db in db_files:
      schema_path = os.path.join(test_database_folder_path, db, "schema.sql")

      if os.path.exists(schema_path):
        with open(schema_path, "r", encoding="utf-8") as f:
          content = f.read()

          # Filter out INSERT statements
          schema_lines = [
            line.strip() 
            for line in content.split('\n') 
            if line.strip() and not line.strip().upper().startswith('INSERT')
          ]

          # Write database identifier and its schema
          out_file.write(f"Database: {db}\n")
          out_file.write("=" * 50 + "\n")
          out_file.write("\n".join(schema_lines))
          out_file.write("\n\n" + "=" * 50 + "\n\n")

In [19]:
def create_gemini_prompt(questions):
    prompt_template = """You are an expert in SQL. Given a database schema and a question, generate the correct SQL query to answer the question.

I will provide you with database schemas from different databases. The schemas are separated by '=' lines.
Each schema section starts with 'Database: <database_name>'

For each question, you need to:
1. Identify which database the question is about
2. Use the correct schema to write a SQL query that answers the question
3. Ensure the query follows SQL best practices

Here are the database schemas:
{schemas}

For each of these questions, generate the SQL query:
{formatted_questions}

For each question, provide your answer in this format:
[SQL query]\t[database name]
"""

    # Read the schemas file
    with open("all_schemas.txt", "r", encoding="utf-8") as f:
        schemas = f.read()

    # Format the questions
    formatted_questions = "\n".join([f"{i+1}. {q}" for i, q in enumerate(questions)])

    # Create the final prompt
    final_prompt = prompt_template.format(
        schemas=schemas, formatted_questions=formatted_questions
    )

    return final_prompt

In [20]:
def get_gemini_preds(questions):
    prompt = create_gemini_prompt(questions)
    response = model.generate_content(prompt)
    return response.text

In [22]:
gemini_preds = get_gemini_preds(get_test_questions())
gemini_preds

"```sql\nSELECT\n  COUNT(*)\nFROM singer;\n```\tsinger\n\n```sql\nSELECT\n  SUM(1)\nFROM singer;\n```\tsinger\n\n```sql\nSELECT\n  name,\n  country,\n  age\nFROM singer\nORDER BY\n  age DESC;\n```\tsinger\n\n```sql\nSELECT\n  name,\n  country,\n  age\nFROM singer\nORDER BY\n  age DESC;\n```\tsinger\n\n```sql\nSELECT\n  AVG(age),\n  MIN(age),\n  MAX(age)\nFROM singer\nWHERE\n  country = 'France';\n```\tsinger\n\n```sql\nSELECT\n  AVG(age),\n  MIN(age),\n  MAX(age)\nFROM singer\nWHERE\n  country = 'France';\n```\tsinger\n\n```sql\nSELECT\n  T1.title,\n  T1.Song_release_year\nFROM song AS T1\nINNER JOIN singer AS T2\n  ON T1.Singer_ID = T2.Singer_ID\nORDER BY\n  T2.age\nLIMIT 1;\n```\tsinger\n\n```sql\nSELECT\n  T1.title,\n  T1.Song_release_year\nFROM song AS T1\nINNER JOIN singer AS T2\n  ON T1.Singer_ID = T2.Singer_ID\nORDER BY\n  T2.age\nLIMIT 1;\n```\tsinger\n\n```sql\nSELECT DISTINCT\n  country\nFROM singer\nWHERE\n  age > 20;\n```\tsinger\n\n```sql\nSELECT DISTINCT\n  country\nFROM singer\nWHERE\n  age > 20;\n```\tsinger\n\n```sql\nSELECT\n  country,\n  COUNT(*)\nFROM singer\nGROUP BY\n  country;\n```\tsinger\n\n```sql\nSELECT\n  country,\n  COUNT(*)\nFROM singer\nGROUP BY\n  country;\n```\tsinger\n\n```sql\nSELECT\n  song_name\nFROM song\nWHERE\n  artist_name IN (\n    SELECT\n      artist_name\n    FROM artist\n    WHERE\n      age > (\n        SELECT\n          AVG(age)\n        FROM artist\n      )\n  );\n```\tmusic_1\n\n```sql\nSELECT\n  song_name\nFROM song\nWHERE\n  artist_name IN (\n    SELECT\n      artist_name\n    FROM artist\n    WHERE\n      age > (\n        SELECT\n          AVG(age)\n        FROM artist\n      )\n  );\n```\tmusic_1\n\n```sql\nSELECT\n  Location,\n  Name\nFROM stadium\nWHERE\n  Capacity BETWEEN 5000 AND 10000;\n```\tconcert_singer\n\n```sql\nSELECT\n  Location,\n  Name\nFROM stadium\nWHERE\n  Capacity BETWEEN 5000 AND 10000;\n```\tconcert_singer\n\n```sql\nSELECT\n  MAX(Capacity),\n  AVG(Capacity)\nFROM stadium;\n```\tconcert_singer\n\n```sql\nSELECT\n  MAX(Capacity),\n  AVG(Capacity)\nFROM stadium;\n```\tconcert_singer\n\n```sql\nSELECT\n  Name,\n  Capacity\nFROM stadium\nORDER BY\n  Average DESC\nLIMIT 1;\n```\tconcert_singer\n\n```sql\nSELECT\n  Name,\n  Capacity\nFROM stadium\nORDER BY\n  Average DESC\nLIMIT 1;\n```\tconcert_singer\n\n```sql\nSELECT\n  COUNT(*)\nFROM concert\nWHERE\n  Year IN ('2014', '2015');\n```\tconcert_singer\n\n```sql\nSELECT\n  COUNT(*)\nFROM concert\nWHERE\n  Year IN ('2014', '2015');\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name,\n  COUNT(*)\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nGROUP BY\n  T1.Name;\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name,\n  COUNT(*)\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nGROUP BY\n  T1.Name;\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name,\n  T1.Capacity\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nGROUP BY\n  T1.Name\nORDER BY\n  COUNT(*) DESC\nLIMIT 1;\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name,\n  T1.Capacity\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nGROUP BY\n  T1.Name\nORDER BY\n  COUNT(*) DESC\nLIMIT 1;\n```\tconcert_singer\n\n```sql\nSELECT\n  Year\nFROM concert\nGROUP BY\n  Year\nORDER BY\n  COUNT(*) DESC\nLIMIT 1;\n```\tconcert_singer\n\n```sql\nSELECT\n  Year\nFROM concert\nGROUP BY\n  Year\nORDER BY\n  COUNT(*) DESC\nLIMIT 1;\n```\tconcert_singer\n\n```sql\nSELECT\n  Name\nFROM stadium\nEXCEPT\nSELECT\n  T1.Name\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID;\n```\tconcert_singer\n\n```sql\nSELECT\n  Name\nFROM stadium\nEXCEPT\nSELECT\n  T1.Name\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID;\n```\tconcert_singer\n\n```sql\nSELECT\n  country\nFROM singer\nWHERE\n  age > 40\nINTERSECT\nSELECT\n  country\nFROM singer\nWHERE\n  age < 30;\n```\tsinger\n\n```sql\nSELECT\n  Name\nFROM stadium\nEXCEPT\nSELECT\n  T1.Name\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nWHERE\n  T2.Year = '2014';\n```\tconcert_singer\n\n```sql\nSELECT\n  Name\nFROM stadium\nEXCEPT\nSELECT\n  T1.Name\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nWHERE\n  T2.Year = '2014';\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.concert_Name,\n  T1.Theme,\n  COUNT(T2.Singer_ID)\nFROM concert AS T1\nINNER JOIN singer_in_concert AS T2\n  ON T1.concert_ID = T2.concert_ID\nGROUP BY\n  T1.concert_Name;\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.concert_Name,\n  T1.Theme,\n  COUNT(T2.Singer_ID)\nFROM concert AS T1\nINNER JOIN singer_in_concert AS T2\n  ON T1.concert_ID = T2.concert_ID\nGROUP BY\n  T1.concert_Name;\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name,\n  COUNT(T2.Singer_ID)\nFROM singer AS T1\nINNER JOIN singer_in_concert AS T2\n  ON T1.Singer_ID = T2.Singer_ID\nGROUP BY\n  T1.Name;\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name,\n  COUNT(T2.Singer_ID)\nFROM singer AS T1\nINNER JOIN singer_in_concert AS T2\n  ON T1.Singer_ID = T2.Singer_ID\nGROUP BY\n  T1.Name;\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name\nFROM singer AS T1\nINNER JOIN singer_in_concert AS T2\n  ON T1.Singer_ID = T2.Singer_ID\nINNER JOIN concert AS T3\n  ON T2.concert_ID = T3.concert_ID\nWHERE\n  T3.Year = '2014';\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name\nFROM singer AS T1\nINNER JOIN singer_in_concert AS T2\n  ON T1.Singer_ID = T2.Singer_ID\nINNER JOIN concert AS T3\n  ON T2.concert_ID = T3.concert_ID\nWHERE\n  T3.Year = '2014';\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name,\n  T1.Country\nFROM singer AS T1\nINNER JOIN song AS T2\n  ON T1.Singer_ID = T2.Singer_ID\nWHERE\n  T2.Title LIKE '%Hey%';\n```\tsinger\n\n```sql\nSELECT\n  T1.Name,\n  T1.Country\nFROM singer AS T1\nINNER JOIN song AS T2\n  ON T1.Singer_ID = T2.Singer_ID\nWHERE\n  T2.Title LIKE '%Hey%';\n```\tsinger\n\n```sql\nSELECT\n  T1.Name,\n  T1.Location\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nWHERE\n  T2.Year = '2014'\nINTERSECT\nSELECT\n  T1.Name,\n  T1.Location\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nWHERE\n  T2.Year = '2015';\n```\tconcert_singer\n\n```sql\nSELECT\n  T1.Name,\n  T1.Location\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nWHERE\n  T2.Year = '2014'\nINTERSECT\nSELECT\n  T1.Name,\n  T1.Location\nFROM stadium AS T1\nINNER JOIN concert AS T2\n  ON T1.Stadium_ID = T2.Stadium_ID\nWHERE\n  T2.Year = '2015';\n```\tconcert_singer\n\n```sql\nSELECT\n  COUNT(*)\nFROM concert\nWHERE\n  Stadium_ID = (\n    SELECT\n      Stadium_ID\n    FROM stadium\n    ORDER BY\n      Capacity DESC\n    LIMIT 1\n  );\n```\tconcert_singer\n\n```sql\nSELECT\n  COUNT(*)\nFROM concert\nWHERE\n  Stadium_ID = (\n    SELECT\n      Stadium_ID\n    FROM stadium\n    ORDER BY\n      Capacity DESC\n    LIMIT 1\n  );\n```\tconcert_singer\n\n```sql\nSELECT\n  COUNT(*)\nFROM Pets\nWHERE\n  weight > 10;\n```\tpets_1\n\n```sql\nSELECT\n  COUNT(*)\nFROM Pets\nWHERE\n  weight > 10;\n```\tpets_1\n\n```sql\nSELECT\n  weight\nFROM Pets\nORDER BY\n  pet_age\nLIMIT 1;\n```\tpets_1\n\n```sql\nSELECT\n  weight\nFROM Pets\nORDER BY\n  pet_age\nLIMIT 1;\n```\tpets_1\n\n```sql\nSELECT\n  MAX(weight),\n  PetType\nFROM Pets\nGROUP BY\n  PetType;\n```\tpets_1\n\n```sql\nSELECT\n  MAX(weight),\n  PetType\nFROM Pets\nGROUP BY\n  PetType;\n```\tpets_1\n\n```sql\nSELECT\n  COUNT(*)\nFROM Has_Pet\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Student\n    WHERE\n      Age > 20\n  );\n```\tpets_1\n\n```sql\nSELECT\n  COUNT(*)\nFROM Has_Pet\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Student\n    WHERE\n      Age > 20\n  );\n```\tpets_1\n\n```sql\nSELECT\n  COUNT(*)\nFROM Has_Pet\nINNER JOIN Pets\n  ON Has_Pet.PetID = Pets.PetID\nWHERE\n  Pets.PetType = 'Dog'\n  AND StuID IN (\n    SELECT\n      StuID\n    FROM Student\n    WHERE\n      Sex = 'F'\n  );\n```\tpets_1\n\n```sql\nSELECT\n  COUNT(*)\nFROM Has_Pet\nINNER JOIN Pets\n  ON Has_Pet.PetID = Pets.PetID\nWHERE\n  Pets.PetType = 'Dog'\n  AND StuID IN (\n    SELECT\n      StuID\n    FROM Student\n    WHERE\n      Sex = 'F'\n  );\n```\tpets_1\n\n```sql\nSELECT\n  COUNT(DISTINCT PetType)\nFROM Pets;\n```\tpets_1\n\n```sql\nSELECT\n  COUNT(DISTINCT PetType)\nFROM Pets;\n```\tpets_1\n\n```sql\nSELECT\n  Fname\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat' OR PetType = 'Dog'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  Fname\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat' OR PetType = 'Dog'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  Fname\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat'\n      )\n  )\n  AND StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Dog'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  Fname\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat'\n      )\n  )\n  AND StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Dog'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  Major,\n  Age\nFROM Student\nWHERE\n  StuID NOT IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  Major,\n  Age\nFROM Student\nWHERE\n  StuID NOT IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  StuID\nFROM Student\nWHERE\n  StuID NOT IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  StuID\nFROM Student\nWHERE\n  StuID NOT IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  Fname,\n  Age\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Dog'\n      )\n  )\n  AND StuID NOT IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  Fname,\n  Age\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Dog'\n      )\n  )\n  AND StuID NOT IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat'\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  PetType,\n  weight\nFROM Pets\nORDER BY\n  pet_age\nLIMIT 1;\n```\tpets_1\n\n```sql\nSELECT\n  PetType,\n  weight\nFROM Pets\nORDER BY\n  pet_age\nLIMIT 1;\n```\tpets_1\n\n```sql\nSELECT\n  PetID,\n  weight\nFROM Pets\nWHERE\n  pet_age > 1;\n```\tpets_1\n\n```sql\nSELECT\n  PetID,\n  weight\nFROM Pets\nWHERE\n  pet_age > 1;\n```\tpets_1\n\n```sql\nSELECT\n  AVG(pet_age),\n  MAX(pet_age)\nFROM Pets\nGROUP BY\n  PetType;\n```\tpets_1\n\n```sql\nSELECT\n  AVG(pet_age),\n  MAX(pet_age)\nFROM Pets\nGROUP BY\n  PetType;\n```\tpets_1\n\n```sql\nSELECT\n  AVG(weight)\nFROM Pets\nGROUP BY\n  PetType;\n```\tpets_1\n\n```sql\nSELECT\n  AVG(weight)\nFROM Pets\nGROUP BY\n  PetType;\n```\tpets_1\n\n```sql\nSELECT\n  Fname,\n  Age\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n  );\n```\tpets_1\n\n```sql\nSELECT\n  Fname,\n  Age\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n  );\n```\tpets_1\n\n```sql\nSELECT\n  PetID\nFROM Has_Pet\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Student\n    WHERE\n      LName = 'Smith'\n  );\n```\tpets_1\n\n```sql\nSELECT\n  PetID\nFROM Has_Pet\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Student\n    WHERE\n      LName = 'Smith'\n  );\n```\tpets_1\n\n```sql\nSELECT\n  StuID,\n  COUNT(*)\nFROM Has_Pet\nGROUP BY\n  StuID;\n```\tpets_1\n\n```sql\nSELECT\n  StuID,\n  COUNT(*)\nFROM Has_Pet\nGROUP BY\n  StuID;\n```\tpets_1\n\n```sql\nSELECT\n  Fname,\n  Sex\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    GROUP BY\n      StuID\n    HAVING\n      COUNT(*) > 1\n  );\n```\tpets_1\n\n```sql\nSELECT\n  Fname,\n  Sex\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    GROUP BY\n      StuID\n    HAVING\n      COUNT(*) > 1\n  );\n```\tpets_1\n\n```sql\nSELECT\n  LName\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat' AND pet_age = 3\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  LName\nFROM Student\nWHERE\n  StuID IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n    WHERE\n      PetID IN (\n        SELECT\n          PetID\n        FROM Pets\n        WHERE\n          PetType = 'Cat' AND pet_age = 3\n      )\n  );\n```\tpets_1\n\n```sql\nSELECT\n  AVG(Age)\nFROM Student\nWHERE\n  StuID NOT IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n  );\n```\tpets_1\n\n```sql\nSELECT\n  AVG(Age)\nFROM Student\nWHERE\n  StuID NOT IN (\n    SELECT\n      StuID\n    FROM Has_Pet\n  );\n```\tpets_1\n\n```sql\nSELECT\n  COUNT(DISTINCT continent)\nFROM organization;\n```\tacademic\n\n```sql\nSELECT\n  COUNT(DISTINCT continent)\nFROM organization;\n```\tacademic\n\n```sql\nSELECT\n  T1.REGION_ID,\n  T1.REGION_NAME,\n  COUNT(T2.COUNTRY_ID)\nFROM regions AS T1\nINNER JOIN countries AS T2\n  ON T1.REGION_ID = T2.REGION_ID\nGROUP BY\n  T1.REGION_ID;\n```\thr_1\n\n```sql\nSELECT\n  T1.REGION_ID,\n  T1.REGION_NAME,\n  COUNT(T2.COUNTRY_ID)\nFROM regions AS T1\nINNER JOIN countries AS T2\n  ON T1.REGION_ID = T2.REGION_ID\nGROUP BY\n  T1.REGION_ID;\n```\thr_1\n\n```sql\nSELECT\n  COUNT(*)\nFROM countries;\n```\thr_1\n\n```sql\nSELECT\n  COUNT(*)\nFROM countries;\n```\thr_1\n\n```sql\nSELECT\n  COUNT(*)\nFROM countries;\n```\thr_1\n\n```sql\nSELECT\n  COUNT(*)\nFROM countries;\n```\thr_1\n\n```sql\nSELECT\n  T1.Make,\n  COUNT(T2.Model)\nFROM team AS T1\nINNER JOIN car AS T2\n  ON T1.Make = T2.Make\nGROUP BY\n  T1.Make;\n```\tcar_racing\n\n```sql\nSELECT\n  T1.Make,\n  COUNT(T2.Model)\nFROM team AS T1\nINNER JOIN car AS T2\n  ON T1.Make = T2.Make\nGROUP BY\n  T1.Make;\n```\tcar_racing\n\n```sql\nSELECT\n  Model\nFROM car\nORDER BY\n  Horsepower\nLIMIT 1;\n```\tcar_racing\n\n```sql\nSELECT\n  Model\nFROM car\nORDER BY\n  Horsepower\nLIMIT 1;\n```\tcar_racing\n\n```sql\nSELECT\n  Model\nFROM car\nWHERE\n  Weight < (\n    SELECT\n      AVG(Weight)\n    FROM car\n  );\n```\tcar_racing\n\n```sql\nSELECT\n  Model\nFROM car\nWHERE\n  Weight < (\n    SELECT\n      AVG(Weight)\n    FROM car\n  );\n```\tcar_racing\n\n```sql\nSELECT\n  Make\nFROM car\nWHERE\n  Model_year = 1970;\n```\tcar_racing\n\n```sql\nSELECT\n  Make\nFROM car\nWHERE\n  Model_year = 1970;\n```\tcar_racing\n\n```sql\nSELECT\n  Make,\n  MIN(Model_year)\nFROM car\nGROUP BY\n  Make\nORDER BY\n  MIN(Model_year)\nLIMIT 1;\n```\tcar_racing\n\n```sql\nSELECT\n  Make,\n  MIN(Model_year)\nFROM car\nGROUP BY\n  Make\nORDER BY\n  MIN(Model_year)\nLIMIT 1;\n```\tcar_racing\n\n```sql\nSELECT\n  Model\nFROM car\nWHERE\n  Model_year > 1980;\n```\tcar_racing\n\n```sql\nSELECT\n  Model\nFROM car\nWHERE\n  Model_year > 1980;\n```\tcar_racing\n\n```sql\nSELECT\n  T1.continent,\n  COUNT(T2.Make)\nFROM continent AS T1\nINNER JOIN car AS T2\n  ON T1.continent = T2.continent\nGROUP BY\n  T1.continent;\n```\tcar_racing\n\n```sql\nSELECT\n  T1.continent,\n  COUNT(T2.Make)\nFROM continent AS T1\nINNER JOIN car AS T2\n  ON T1.continent = T2.continent\nGROUP BY\n  T1.continent;\n```\tcar_racing\n\n```sql\nSELECT\n  Country\nFROM car\nGROUP BY\n  Country\nORDER BY\n  COUNT(*) DESC\nLIMIT 1;\n```\tcar_racing\n\n```sql\nSELECT\n  Country\nFROM car\nGROUP BY\n  Country\nORDER BY\n  COUNT(*) DESC\nLIMIT 1;\n```\tcar_racing\n\n```sql\nSELECT\n  COUNT(Model),\n  Make\nFROM car\nGROUP BY\n  Make;\n```\tcar_racing\n\n```sql\nSELECT\n  COUNT(Model),\n  Make\nFROM car\nGROUP BY\n  Make;\n```\tcar_racing\n\n```sql\nSELECT\n  Accelerate\nFROM car\nWHERE\n  Make = 'amc hornet sportabout (sw)';\n```\tcar_racing\n\n```sql\nSELECT\n  Accelerate\nFROM car\nWHERE\n  Make = 'amc hornet sportabout (sw)';\n```\tcar_racing\n\n```sql\nSELECT\n  COUNT(*)\nFROM car\nWHERE\n  Country = 'France';\n```\tcar_racing\n\n```sql\nSELECT\n  COUNT(*)\nFROM car\nWHERE\n  Country = 'France';\n```\tcar_racing\n\n```sql\nSELECT\n  COUNT(*)\nFROM car\nWHERE\n  Country = 'USA';\n```\tcar_racing\n\n```sql\nSELECT\n  COUNT(*)\nFROM car\nWHERE\n  Country = 'USA';\n```\tcar_racing\n\n```sql\nSELECT\n  AVG(Mpg)\nFROM car\nWHERE\n  Cylinders = 4;\n```\tcar_racing\n\n```sql\nSELECT\n  AVG(Mpg)\nFROM car\nWHERE\n  Cylinders = 4;\n```\tcar_racing\n\n```sql\nSELECT\n  MIN(Weight)\nFROM car\nWHERE\n  Cylinders = 8 AND Model_year = 1974;\n```\tcar_racing\n\n```sql\nSELECT\n  MIN(Weight)\nFROM car\nWHERE\n  Cylinders = 8 AND Model_year = 1974;\n```\tcar_racing\n\n```sql\nSELECT\n  Make,\n  Model\nFROM car;\n```\tcar_racing\n\n```sql\nSELECT\n  Make,\n  Model\nFROM car;\n```\tcar_racing\n\n```sql\nSELECT\n  DISTINCT Country,\n  Country_Id\nFROM car;\n```\tcar_racing\n\n```sql\nSELECT\n  DISTINCT Country,\n  Country_Id\nFROM car;\n```\tcar_racing\n\n```sql\nSELECT\n  COUNT(*)\nFROM car\nWHERE\n  Horsepower > 150;\n```\tcar_racing\n\n```sql\nSELECT\n  COUNT(*)\nFROM car\nWHERE\n  Horsepower > 150;\n```\tcar_racing\n\n```sql\nSELECT\n  AVG(Weight),\n  Model_year\nFROM car\nGROUP BY\n  Model_year;\n```\tcar_racing\n\n```sql\nSELECT\n  AVG(Weight),\n  Model_year\nFROM car\nGROUP BY\n  Model_year;\n```\tcar_racing\n\n```sql\nSELECT\n  Country\nFROM car\nWHERE\n  Country IN (\n    SELECT\n      Country\n    FROM car\n    GROUP BY\n      Country\n    HAVING\n      COUNT(*) >= 3\n  )\n  AND Country IN (\n    SELECT\n      Country\n    FROM car\n    WHERE\n      continent = 'Europe'\n  );\n```\tcar_racing\n\n```sql\nSELECT\n  Country\nFROM car\nWHERE\n  Country IN (\n    SELECT\n      Country\n    FROM car\n    GROUP BY\n      Country\n    HAVING\n      COUNT(*) >= 3\n  )\n  AND Country IN (\n    SELECT\n      Country\n    FROM car\n    WHERE\n      continent = 'Europe'\n  );\n```\tcar_racing\n\n```sql\nSELECT\n  MAX(Horsepower),\n  Make\nFROM car\nWHERE\n  Cylinders = 3;\n```\tcar_racing\n\n```sql\nSELECT\n  MAX(Horsepower),\n  Make\nFROM car\nWHERE\n  Cylinders = 3;\n```\tcar_racing\n\n```sql\nSELECT\n  Model\nFROM car\nORDER BY\n  Mpg DESC\nLIMIT 1;\n```\tcar_racing\n\n```sql\nSELECT\n  Model\nFROM car\nORDER BY\n  Mpg DESC\nLIMIT 1;\n```\tcar_racing\n\n```sql\nSELECT\n  AVG(Horsepower)\nFROM car\nWHERE\n  Model_ye

In [29]:
print(gemini_preds)

```sql
SELECT
  COUNT(*)
FROM singer;
```	singer

```sql
SELECT
  SUM(1)
FROM singer;
```	singer

```sql
SELECT
  name,
  country,
  age
FROM singer
ORDER BY
  age DESC;
```	singer

```sql
SELECT
  name,
  country,
  age
FROM singer
ORDER BY
  age DESC;
```	singer

```sql
SELECT
  AVG(age),
  MIN(age),
  MAX(age)
FROM singer
WHERE
  country = 'France';
```	singer

```sql
SELECT
  AVG(age),
  MIN(age),
  MAX(age)
FROM singer
WHERE
  country = 'France';
```	singer

```sql
SELECT
  T1.title,
  T1.Song_release_year
FROM song AS T1
INNER JOIN singer AS T2
  ON T1.Singer_ID = T2.Singer_ID
ORDER BY
  T2.age
LIMIT 1;
```	singer

```sql
SELECT
  T1.title,
  T1.Song_release_year
FROM song AS T1
INNER JOIN singer AS T2
  ON T1.Singer_ID = T2.Singer_ID
ORDER BY
  T2.age
LIMIT 1;
```	singer

```sql
SELECT DISTINCT
  country
FROM singer
WHERE
  age > 20;
```	singer

```sql
SELECT DISTINCT
  country
FROM singer
WHERE
  age > 20;
```	singer

```sql
SELECT
  country,
  COUNT(*)
FROM singer
GROUP BY
  country;
```	singer

```sql
SELECT
  country,
  COUNT(*)
FROM singer
GROUP BY
  country;
```	singer

```sql
SELECT
  song_name
FROM song
WHERE
  artist_name IN (
    SELECT
      artist_name
    FROM artist
    WHERE
      age > (
        SELECT
          AVG(age)
        FROM artist
      )
  );
```	music_1

```sql
SELECT
  song_name
FROM song
WHERE
  artist_name IN (
    SELECT
      artist_name
    FROM artist
    WHERE
      age > (
        SELECT
          AVG(age)
        FROM artist
      )
  );
```	music_1

```sql
SELECT
  Location,
  Name
FROM stadium
WHERE
  Capacity BETWEEN 5000 AND 10000;
```	concert_singer

```sql
SELECT
  Location,
  Name
FROM stadium
WHERE
  Capacity BETWEEN 5000 AND 10000;
```	concert_singer

```sql
SELECT
  MAX(Capacity),
  AVG(Capacity)
FROM stadium;
```	concert_singer

```sql
SELECT
  MAX(Capacity),
  AVG(Capacity)
FROM stadium;
```	concert_singer

```sql
SELECT
  Name,
  Capacity
FROM stadium
ORDER BY
  Average DESC
LIMIT 1;
```	concert_singer

```sql
SELECT
  Name,
  Capacity
FROM stadium
ORDER BY
  Average DESC
LIMIT 1;
```	concert_singer

```sql
SELECT
  COUNT(*)
FROM concert
WHERE
  Year IN ('2014', '2015');
```	concert_singer

```sql
SELECT
  COUNT(*)
FROM concert
WHERE
  Year IN ('2014', '2015');
```	concert_singer

```sql
SELECT
  T1.Name,
  COUNT(*)
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
GROUP BY
  T1.Name;
```	concert_singer

```sql
SELECT
  T1.Name,
  COUNT(*)
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
GROUP BY
  T1.Name;
```	concert_singer

```sql
SELECT
  T1.Name,
  T1.Capacity
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
GROUP BY
  T1.Name
ORDER BY
  COUNT(*) DESC
LIMIT 1;
```	concert_singer

```sql
SELECT
  T1.Name,
  T1.Capacity
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
GROUP BY
  T1.Name
ORDER BY
  COUNT(*) DESC
LIMIT 1;
```	concert_singer

```sql
SELECT
  Year
FROM concert
GROUP BY
  Year
ORDER BY
  COUNT(*) DESC
LIMIT 1;
```	concert_singer

```sql
SELECT
  Year
FROM concert
GROUP BY
  Year
ORDER BY
  COUNT(*) DESC
LIMIT 1;
```	concert_singer

```sql
SELECT
  Name
FROM stadium
EXCEPT
SELECT
  T1.Name
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID;
```	concert_singer

```sql
SELECT
  Name
FROM stadium
EXCEPT
SELECT
  T1.Name
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID;
```	concert_singer

```sql
SELECT
  country
FROM singer
WHERE
  age > 40
INTERSECT
SELECT
  country
FROM singer
WHERE
  age < 30;
```	singer

```sql
SELECT
  Name
FROM stadium
EXCEPT
SELECT
  T1.Name
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
WHERE
  T2.Year = '2014';
```	concert_singer

```sql
SELECT
  Name
FROM stadium
EXCEPT
SELECT
  T1.Name
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
WHERE
  T2.Year = '2014';
```	concert_singer

```sql
SELECT
  T1.concert_Name,
  T1.Theme,
  COUNT(T2.Singer_ID)
FROM concert AS T1
INNER JOIN singer_in_concert AS T2
  ON T1.concert_ID = T2.concert_ID
GROUP BY
  T1.concert_Name;
```	concert_singer

```sql
SELECT
  T1.concert_Name,
  T1.Theme,
  COUNT(T2.Singer_ID)
FROM concert AS T1
INNER JOIN singer_in_concert AS T2
  ON T1.concert_ID = T2.concert_ID
GROUP BY
  T1.concert_Name;
```	concert_singer

```sql
SELECT
  T1.Name,
  COUNT(T2.Singer_ID)
FROM singer AS T1
INNER JOIN singer_in_concert AS T2
  ON T1.Singer_ID = T2.Singer_ID
GROUP BY
  T1.Name;
```	concert_singer

```sql
SELECT
  T1.Name,
  COUNT(T2.Singer_ID)
FROM singer AS T1
INNER JOIN singer_in_concert AS T2
  ON T1.Singer_ID = T2.Singer_ID
GROUP BY
  T1.Name;
```	concert_singer

```sql
SELECT
  T1.Name
FROM singer AS T1
INNER JOIN singer_in_concert AS T2
  ON T1.Singer_ID = T2.Singer_ID
INNER JOIN concert AS T3
  ON T2.concert_ID = T3.concert_ID
WHERE
  T3.Year = '2014';
```	concert_singer

```sql
SELECT
  T1.Name
FROM singer AS T1
INNER JOIN singer_in_concert AS T2
  ON T1.Singer_ID = T2.Singer_ID
INNER JOIN concert AS T3
  ON T2.concert_ID = T3.concert_ID
WHERE
  T3.Year = '2014';
```	concert_singer

```sql
SELECT
  T1.Name,
  T1.Country
FROM singer AS T1
INNER JOIN song AS T2
  ON T1.Singer_ID = T2.Singer_ID
WHERE
  T2.Title LIKE '%Hey%';
```	singer

```sql
SELECT
  T1.Name,
  T1.Country
FROM singer AS T1
INNER JOIN song AS T2
  ON T1.Singer_ID = T2.Singer_ID
WHERE
  T2.Title LIKE '%Hey%';
```	singer

```sql
SELECT
  T1.Name,
  T1.Location
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
WHERE
  T2.Year = '2014'
INTERSECT
SELECT
  T1.Name,
  T1.Location
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
WHERE
  T2.Year = '2015';
```	concert_singer

```sql
SELECT
  T1.Name,
  T1.Location
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
WHERE
  T2.Year = '2014'
INTERSECT
SELECT
  T1.Name,
  T1.Location
FROM stadium AS T1
INNER JOIN concert AS T2
  ON T1.Stadium_ID = T2.Stadium_ID
WHERE
  T2.Year = '2015';
```	concert_singer

```sql
SELECT
  COUNT(*)
FROM concert
WHERE
  Stadium_ID = (
    SELECT
      Stadium_ID
    FROM stadium
    ORDER BY
      Capacity DESC
    LIMIT 1
  );
```	concert_singer

```sql
SELECT
  COUNT(*)
FROM concert
WHERE
  Stadium_ID = (
    SELECT
      Stadium_ID
    FROM stadium
    ORDER BY
      Capacity DESC
    LIMIT 1
  );
```	concert_singer

```sql
SELECT
  COUNT(*)
FROM Pets
WHERE
  weight > 10;
```	pets_1

```sql
SELECT
  COUNT(*)
FROM Pets
WHERE
  weight > 10;
```	pets_1

```sql
SELECT
  weight
FROM Pets
ORDER BY
  pet_age
LIMIT 1;
```	pets_1

```sql
SELECT
  weight
FROM Pets
ORDER BY
  pet_age
LIMIT 1;
```	pets_1

```sql
SELECT
  MAX(weight),
  PetType
FROM Pets
GROUP BY
  PetType;
```	pets_1

```sql
SELECT
  MAX(weight),
  PetType
FROM Pets
GROUP BY
  PetType;
```	pets_1

```sql
SELECT
  COUNT(*)
FROM Has_Pet
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Student
    WHERE
      Age > 20
  );
```	pets_1

```sql
SELECT
  COUNT(*)
FROM Has_Pet
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Student
    WHERE
      Age > 20
  );
```	pets_1

```sql
SELECT
  COUNT(*)
FROM Has_Pet
INNER JOIN Pets
  ON Has_Pet.PetID = Pets.PetID
WHERE
  Pets.PetType = 'Dog'
  AND StuID IN (
    SELECT
      StuID
    FROM Student
    WHERE
      Sex = 'F'
  );
```	pets_1

```sql
SELECT
  COUNT(*)
FROM Has_Pet
INNER JOIN Pets
  ON Has_Pet.PetID = Pets.PetID
WHERE
  Pets.PetType = 'Dog'
  AND StuID IN (
    SELECT
      StuID
    FROM Student
    WHERE
      Sex = 'F'
  );
```	pets_1

```sql
SELECT
  COUNT(DISTINCT PetType)
FROM Pets;
```	pets_1

```sql
SELECT
  COUNT(DISTINCT PetType)
FROM Pets;
```	pets_1

```sql
SELECT
  Fname
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat' OR PetType = 'Dog'
      )
  );
```	pets_1

```sql
SELECT
  Fname
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat' OR PetType = 'Dog'
      )
  );
```	pets_1

```sql
SELECT
  Fname
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat'
      )
  )
  AND StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Dog'
      )
  );
```	pets_1

```sql
SELECT
  Fname
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat'
      )
  )
  AND StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Dog'
      )
  );
```	pets_1

```sql
SELECT
  Major,
  Age
FROM Student
WHERE
  StuID NOT IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat'
      )
  );
```	pets_1

```sql
SELECT
  Major,
  Age
FROM Student
WHERE
  StuID NOT IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat'
      )
  );
```	pets_1

```sql
SELECT
  StuID
FROM Student
WHERE
  StuID NOT IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat'
      )
  );
```	pets_1

```sql
SELECT
  StuID
FROM Student
WHERE
  StuID NOT IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat'
      )
  );
```	pets_1

```sql
SELECT
  Fname,
  Age
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Dog'
      )
  )
  AND StuID NOT IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat'
      )
  );
```	pets_1

```sql
SELECT
  Fname,
  Age
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Dog'
      )
  )
  AND StuID NOT IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat'
      )
  );
```	pets_1

```sql
SELECT
  PetType,
  weight
FROM Pets
ORDER BY
  pet_age
LIMIT 1;
```	pets_1

```sql
SELECT
  PetType,
  weight
FROM Pets
ORDER BY
  pet_age
LIMIT 1;
```	pets_1

```sql
SELECT
  PetID,
  weight
FROM Pets
WHERE
  pet_age > 1;
```	pets_1

```sql
SELECT
  PetID,
  weight
FROM Pets
WHERE
  pet_age > 1;
```	pets_1

```sql
SELECT
  AVG(pet_age),
  MAX(pet_age)
FROM Pets
GROUP BY
  PetType;
```	pets_1

```sql
SELECT
  AVG(pet_age),
  MAX(pet_age)
FROM Pets
GROUP BY
  PetType;
```	pets_1

```sql
SELECT
  AVG(weight)
FROM Pets
GROUP BY
  PetType;
```	pets_1

```sql
SELECT
  AVG(weight)
FROM Pets
GROUP BY
  PetType;
```	pets_1

```sql
SELECT
  Fname,
  Age
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
  );
```	pets_1

```sql
SELECT
  Fname,
  Age
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
  );
```	pets_1

```sql
SELECT
  PetID
FROM Has_Pet
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Student
    WHERE
      LName = 'Smith'
  );
```	pets_1

```sql
SELECT
  PetID
FROM Has_Pet
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Student
    WHERE
      LName = 'Smith'
  );
```	pets_1

```sql
SELECT
  StuID,
  COUNT(*)
FROM Has_Pet
GROUP BY
  StuID;
```	pets_1

```sql
SELECT
  StuID,
  COUNT(*)
FROM Has_Pet
GROUP BY
  StuID;
```	pets_1

```sql
SELECT
  Fname,
  Sex
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    GROUP BY
      StuID
    HAVING
      COUNT(*) > 1
  );
```	pets_1

```sql
SELECT
  Fname,
  Sex
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    GROUP BY
      StuID
    HAVING
      COUNT(*) > 1
  );
```	pets_1

```sql
SELECT
  LName
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat' AND pet_age = 3
      )
  );
```	pets_1

```sql
SELECT
  LName
FROM Student
WHERE
  StuID IN (
    SELECT
      StuID
    FROM Has_Pet
    WHERE
      PetID IN (
        SELECT
          PetID
        FROM Pets
        WHERE
          PetType = 'Cat' AND pet_age = 3
      )
  );
```	pets_1

```sql
SELECT
  AVG(Age)
FROM Student
WHERE
  StuID NOT IN (
    SELECT
      StuID
    FROM Has_Pet
  );
```	pets_1

```sql
SELECT
  AVG(Age)
FROM Student
WHERE
  StuID NOT IN (
    SELECT
      StuID
    FROM Has_Pet
  );
```	pets_1

```sql
SELECT
  COUNT(DISTINCT continent)
FROM organization;
```	academic

```sql
SELECT
  COUNT(DISTINCT continent)
FROM organization;
```	academic

```sql
SELECT
  T1.REGION_ID,
  T1.REGION_NAME,
  COUNT(T2.COUNTRY_ID)
FROM regions AS T1
INNER JOIN countries AS T2
  ON T1.REGION_ID = T2.REGION_ID
GROUP BY
  T1.REGION_ID;
```	hr_1

```sql
SELECT
  T1.REGION_ID,
  T1.REGION_NAME,
  COUNT(T2.COUNTRY_ID)
FROM regions AS T1
INNER JOIN countries AS T2
  ON T1.REGION_ID = T2.REGION_ID
GROUP BY
  T1.REGION_ID;
```	hr_1

```sql
SELECT
  COUNT(*)
FROM countries;
```	hr_1

```sql
SELECT
  COUNT(*)
FROM countries;
```	hr_1

```sql
SELECT
  COUNT(*)
FROM countries;
```	hr_1

```sql
SELECT
  COUNT(*)
FROM countries;
```	hr_1

```sql
SELECT
  T1.Make,
  COUNT(T2.Model)
FROM team AS T1
INNER JOIN car AS T2
  ON T1.Make = T2.Make
GROUP BY
  T1.Make;
```	car_racing

```sql
SELECT
  T1.Make,
  COUNT(T2.Model)
FROM team AS T1
INNER JOIN car AS T2
  ON T1.Make = T2.Make
GROUP BY
  T1.Make;
```	car_racing

```sql
SELECT
  Model
FROM car
ORDER BY
  Horsepower
LIMIT 1;
```	car_racing

```sql
SELECT
  Model
FROM car
ORDER BY
  Horsepower
LIMIT 1;
```	car_racing

```sql
SELECT
  Model
FROM car
WHERE
  Weight < (
    SELECT
      AVG(Weight)
    FROM car
  );
```	car_racing

```sql
SELECT
  Model
FROM car
WHERE
  Weight < (
    SELECT
      AVG(Weight)
    FROM car
  );
```	car_racing

```sql
SELECT
  Make
FROM car
WHERE
  Model_year = 1970;
```	car_racing

```sql
SELECT
  Make
FROM car
WHERE
  Model_year = 1970;
```	car_racing

```sql
SELECT
  Make,
  MIN(Model_year)
FROM car
GROUP BY
  Make
ORDER BY
  MIN(Model_year)
LIMIT 1;
```	car_racing

```sql
SELECT
  Make,
  MIN(Model_year)
FROM car
GROUP BY
  Make
ORDER BY
  MIN(Model_year)
LIMIT 1;
```	car_racing

```sql
SELECT
  Model
FROM car
WHERE
  Model_year > 1980;
```	car_racing

```sql
SELECT
  Model
FROM car
WHERE
  Model_year > 1980;
```	car_racing

```sql
SELECT
  T1.continent,
  COUNT(T2.Make)
FROM continent AS T1
INNER JOIN car AS T2
  ON T1.continent = T2.continent
GROUP BY
  T1.continent;
```	car_racing

```sql
SELECT
  T1.continent,
  COUNT(T2.Make)
FROM continent AS T1
INNER JOIN car AS T2
  ON T1.continent = T2.continent
GROUP BY
  T1.continent;
```	car_racing

```sql
SELECT
  Country
FROM car
GROUP BY
  Country
ORDER BY
  COUNT(*) DESC
LIMIT 1;
```	car_racing

```sql
SELECT
  Country
FROM car
GROUP BY
  Country
ORDER BY
  COUNT(*) DESC
LIMIT 1;
```	car_racing

```sql
SELECT
  COUNT(Model),
  Make
FROM car
GROUP BY
  Make;
```	car_racing

```sql
SELECT
  COUNT(Model),
  Make
FROM car
GROUP BY
  Make;
```	car_racing

```sql
SELECT
  Accelerate
FROM car
WHERE
  Make = 'amc hornet sportabout (sw)';
```	car_racing

```sql
SELECT
  Accelerate
FROM car
WHERE
  Make = 'amc hornet sportabout (sw)';
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Country = 'France';
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Country = 'France';
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Country = 'USA';
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Country = 'USA';
```	car_racing

```sql
SELECT
  AVG(Mpg)
FROM car
WHERE
  Cylinders = 4;
```	car_racing

```sql
SELECT
  AVG(Mpg)
FROM car
WHERE
  Cylinders = 4;
```	car_racing

```sql
SELECT
  MIN(Weight)
FROM car
WHERE
  Cylinders = 8 AND Model_year = 1974;
```	car_racing

```sql
SELECT
  MIN(Weight)
FROM car
WHERE
  Cylinders = 8 AND Model_year = 1974;
```	car_racing

```sql
SELECT
  Make,
  Model
FROM car;
```	car_racing

```sql
SELECT
  Make,
  Model
FROM car;
```	car_racing

```sql
SELECT
  DISTINCT Country,
  Country_Id
FROM car;
```	car_racing

```sql
SELECT
  DISTINCT Country,
  Country_Id
FROM car;
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Horsepower > 150;
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Horsepower > 150;
```	car_racing

```sql
SELECT
  AVG(Weight),
  Model_year
FROM car
GROUP BY
  Model_year;
```	car_racing

```sql
SELECT
  AVG(Weight),
  Model_year
FROM car
GROUP BY
  Model_year;
```	car_racing

```sql
SELECT
  Country
FROM car
WHERE
  Country IN (
    SELECT
      Country
    FROM car
    GROUP BY
      Country
    HAVING
      COUNT(*) >= 3
  )
  AND Country IN (
    SELECT
      Country
    FROM car
    WHERE
      continent = 'Europe'
  );
```	car_racing

```sql
SELECT
  Country
FROM car
WHERE
  Country IN (
    SELECT
      Country
    FROM car
    GROUP BY
      Country
    HAVING
      COUNT(*) >= 3
  )
  AND Country IN (
    SELECT
      Country
    FROM car
    WHERE
      continent = 'Europe'
  );
```	car_racing

```sql
SELECT
  MAX(Horsepower),
  Make
FROM car
WHERE
  Cylinders = 3;
```	car_racing

```sql
SELECT
  MAX(Horsepower),
  Make
FROM car
WHERE
  Cylinders = 3;
```	car_racing

```sql
SELECT
  Model
FROM car
ORDER BY
  Mpg DESC
LIMIT 1;
```	car_racing

```sql
SELECT
  Model
FROM car
ORDER BY
  Mpg DESC
LIMIT 1;
```	car_racing

```sql
SELECT
  AVG(Horsepower)
FROM car
WHERE
  Model_year < 1980;
```	car_racing

```sql
SELECT
  AVG(Horsepower)
FROM car
WHERE
  Model_year < 1980;
```	car_racing

```sql
SELECT
  AVG(Edispl)
FROM car
WHERE
  Model = 'volvo';
```	car_racing

```sql
SELECT
  AVG(Edispl)
FROM car
WHERE
  Model = 'volvo';
```	car_racing

```sql
SELECT
  MAX(Accelerate)
FROM car
GROUP BY
  Cylinders;
```	car_racing

```sql
SELECT
  MAX(Accelerate)
FROM car
GROUP BY
  Cylinders;
```	car_racing

```sql
SELECT
  Model
FROM car
GROUP BY
  Model
ORDER BY
  COUNT(*) DESC
LIMIT 1;
```	car_racing

```sql
SELECT
  Model
FROM car
GROUP BY
  Model
ORDER BY
  COUNT(*) DESC
LIMIT 1;
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Cylinders > 4;
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Cylinders > 4;
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Model_year = 1980;
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Model_year = 1980;
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Make = 'American Motor Company';
```	car_racing

```sql
SELECT
  COUNT(*)
FROM car
WHERE
  Make = 'American Motor Company';
```	car_racing

```sql
SELECT
  Make,
  Make_ID
FROM car
GROUP BY
  Make
HAVING
  COUNT(*) > 3;
```	car_racing

```sql
SELECT
  Make,
  Make_ID
FROM car
GROUP BY
  Make
HAVING
  COUNT(*) > 3;
```	car_racing

```sql
SELECT
  Model
FROM car
WHERE
  Make = 'General Motors' OR Weight > 3500;
```	car_racing

```sql
SELECT
  Model
FROM car
WHERE
  Make = 'General Motors' OR Weight > 3500;
```	car_racing

```sql
SELECT
  Model_year
FROM car
WHERE
  Weight BETWEEN 3000 AND 4000;
```	car_racing

```sql
SELECT
  Model_year
FROM car
WHERE
  Weight BETWEEN 3000 AND 4000;
```	car_racing

```sql
SELECT
  Horsepower
FROM car
ORDER BY
  Accelerate DESC
LIMIT 1;

In [27]:
def format_gemini_preds(gemini_preds: str) -> str:
  # Split the predictions by newline
  lines = gemini_preds.split('\n')
  
  formatted_preds = []
  current_sql = []
  current_db = ''
  
  for line in lines:
    line = line.strip()
    
    # Skip empty lines
    if not line:
      continue
      
    # If line starts with ```sql, start collecting SQL
    if line.startswith('```sql'):
      current_sql = []
      continue
      
    # If line starts with ```, stop collecting SQL
    elif line.startswith('```'):
      # If we have collected SQL and database, format and add to results
      if current_sql and current_db:
        sql = ' '.join(current_sql)
        formatted_preds.append(f"{sql}\t{current_db}")
      continue
      
    # If line has a tab, it's the database name
    elif '\t' in line:
      current_db = line.split('\t')[1]
      continue
      
    # Otherwise it's part of the SQL query  
    else:
      current_sql.append(line)

  formatted_result = '\n'.join(formatted_preds)
      
  # Save formatted result to file
  with open('formatted_predictions.txt', 'w') as f:
    f.write(formatted_result)
      
  return formatted_result

In [28]:
format_gemini_preds(gemini_preds)

''